/**
*  文 件 名：MapData.ts
*  功    能：地图数据
*  内    容：
*  作    者： 羊力大仙
*  生成日期：2015/9/11
*  修改日期：2015/9/11
*  修改日志：
*/
class MapData {
    public static rows:number = 7;
    public static cols:number = 7;
    //第一关地图
    public static map0:Array<any> = [
        [0,1,0,0,1,0,0],
        [0,0,1,0,0,1,0],
        [0,0,1,0,0,0,0],
        [0,0,0,0,0,1,0],
        [0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0]
    ];
    
    //第二关地图
    public static map1:Array<any> = [
        [1,1,1,1,1,1,1],
        [1,1,1,1,1,1,1],
        [1,1,1,1,1,1,1],
        [1,1,1,0,1,1,1],
        [1,1,1,1,1,1,1],
        [1,1,1,1,1,1,1],
        [1,1,1,1,1,1,1]
    ];
}
